Tekla Open API Reference for Tekla Structures 2025
BaseComponent.SetAttribute Method (String, Double)
 Sets the attribute's value to the given value.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAttribute(
	string AttrName,
	double DValue
)
Public Sub SetAttribute (
	AttrName As String,
	DValue As Double
)
Parameters
AttrName
Type: System.String
The name of the attribute.
DValue
Type: System.Double
The double value of the attribute.
See Also
Reference
BaseComponent Class
SetAttribute Overload
Tekla.Structures.Model Namespace